ХМНПФ_Общее/DataProcessors/уп_РасчетЗакрытияДоговора_Альтернативный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РасчетЗакрытияДоговора_Альтернативный</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасчетныйДокумент</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПенсионныеПравила.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПенсионныеПравила</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Правопреемники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПроводкиСводно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПредоставлятьСоциальныйВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВсегдаНачислятьЗаПолныйПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РассчитыватьОУДПриЗачислении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьПроводкиСводноОПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВестиРезервВыплатОПСПоДоговорам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВестиРезервВыплатОПСПоТипамСумм</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписыватьТипыСуммПропорционально</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДФЛПравопреемниковОПС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтрольНомеровДоговоровОПСГод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Корректировать51СчетПоВидамДеятельности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСклонятьФИОВДокументах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасчетИДОПСпоПриказуФСФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеСписыватьИДРасторженцевОПСПриНачислении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СчетНачисленияИДПриЗакрытии</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОпределениеКоличестваВыплат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПечататьФИОВЗаявлениях</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвращатьСредстваУмершихДоВступленияВДействие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МетодРасчетаРазмещенногоПРДляДекларации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонтрольНумерацииДоговоров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ПараметрыПенсионногоДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ПараметрыПенсионногоДоговора</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ШаблонДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ШаблоныДоговоров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПенсионныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаУстановкиСостояния</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеОснованияНПО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Расшифровка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_РасшифровкаСостоянийПС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияОснований</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_КоэффициентыДляРасчетаВыкупныхСумм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_КоэффициентыДляРасчетаВыкупныхСумм</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>8</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДействияПоОстаткам</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ДействияПоОстаткам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплачиватьВНачале</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПересчитыватьНаДатуСмерти</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СхемаДоговор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_СостоянияПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидРасторжения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыРасторжения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантыРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВариантыРасчетаВыкупныхСумм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_ВидыРасторжения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ВидыРасторжения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПоСмерти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Досрочное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПереходВДругойНПФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорВыполнен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/Enums/уп_СостоянияПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_СостоянияПС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОжиданиеВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НакопительныйПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатнойПериод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачисленияПриостановлены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодготовкаКЗакрытию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыплатыПриостановлены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ХМНПФ_Общее/DataProcessors/уп_РасчетЗакрытияДоговора_Альтернативный/Ext/ObjectModule.bsl
&ИзменениеИКонтроль("Рассчитать")
Процедура ХМРассчитать()
	ИмяМодуляРасчетВыкупных = уп_НПОСервер.ПолучитьИмяМодуляРасчетВыкупных();
	Если ИмяМодуляРасчетВыкупных<>Неопределено Тогда
		МодульРасчетаВыкупных = ОбщегоНазначения.ОбщийМодуль(ИмяМодуляРасчетВыкупных);
		МодульРасчетаВыкупных.РасчетЗакрытияДоговора_Альтернативный(ЭтотОбъект);
	Иначе //типовой механизм
		//формируем ТЗ
		//Отбор остатков
		
		#Вставка
		
		Выбыл = Ложь;
		Если ТипЗнч(РасчетныйДокумент) = Тип("ДокументСсылка.уп_ЗакрытиеСчетов") Тогда 
			Если ТипЗнч(РасчетныйДокумент) = Тип("ДокументСсылка.уп_ЗакрытиеСчетов") Тогда 
				Выбыл = (РасчетныйДокумент.ВидРасторженияДоговора = Перечисления.уп_ВидыРасторжения.ПоСмерти);
			КонецЕсли;	     
		КонецЕсли;	
		#КонецВставки		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РезервыОстатки.НомерСчета КАК НомерСчета,
		               |	РезервыОстатки.ТипРезерва КАК ТипРезерва,
		               |	РезервыОстатки.ТипСуммы КАК ТипСуммы,
		               |	ЕСТЬNULL(РезервыОстатки.СуммаОстаток, 0) КАК Сумма,
		               |	РезервыОстатки.ПенсионнаяСхема КАК ПенсионнаяСхема,
		               |	ЕСТЬNULL(уп_ИнвестДоходНПОКФиксацииОстатки.СуммаОстаток, 0) КАК СуммаНезафиксированногоИД
		#Вставка
				    	|"+?(НЕ Выбыл,"","ПОМЕСТИТЬ втОстатки")+"
		#КонецВставки		
		               |ИЗ
		               |	РегистрНакопления.уп_Резервы.Остатки(
		               |			&МомВремени,
		               |			НомерСчета = &НомерСчета
		               |				И ТипРезерва В (&СписокТиповРезерва)) КАК РезервыОстатки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ИнвестДоходНПОКФиксации.Остатки(&МомВремени, НомерСчета = &НомерСчета) КАК уп_ИнвестДоходНПОКФиксацииОстатки
		               |		ПО РезервыОстатки.НомерСчета = уп_ИнвестДоходНПОКФиксацииОстатки.НомерСчета
		               |			И РезервыОстатки.ТипРезерва = уп_ИнвестДоходНПОКФиксацииОстатки.ТипРезерва
		               |			И РезервыОстатки.ТипСуммы = уп_ИнвестДоходНПОКФиксацииОстатки.ТипСуммы
		               |
		               |ДЛЯ ИЗМЕНЕНИЯ
		#Вставка
						|"+?(НЕ Выбыл,"","
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	уп_РезервыОстаткиИОбороты.НомерСчета КАК НомерСчета,
						|	уп_РезервыОстаткиИОбороты.ТипРезерва КАК ТипРезерва,
						|	уп_РезервыОстаткиИОбороты.ТипСуммы КАК ТипСуммы,
						|	уп_РезервыОстаткиИОбороты.ПенсионнаяСхема КАК ПенсионнаяСхема,
						|	Сумма(ЕстьNull(уп_РезервыОстаткиИОбороты.Сумма,0)) КАК СуммаРасход
						|ПОМЕСТИТЬ втРасход
						|ИЗ
						|	РегистрНакопления.уп_Резервы КАК уп_РезервыОстаткиИОбороты
						|ГДЕ  уп_РезервыОстаткиИОбороты.Период >= &ДатаВыбытия
						|	И уп_РезервыОстаткиИОбороты.Период <=	&МомВремени
						|	И уп_РезервыОстаткиИОбороты.НомерСчета В
						|					(ВЫБРАТЬ
						|						втОстатки.НомерСчета КАК НомерСчета
						|					ИЗ
						|						втОстатки КАК втОстатки)
						|	И уп_РезервыОстаткиИОбороты.ТипРезерва В (&СписокТиповРезерва) 
						|	И уп_РезервыОстаткиИОбороты.Движение = ЗНАЧЕНИЕ(Перечисление.уп_ВидыДвижений.ЗакрытиеСчетаНПОСмерть)
						|   И уп_РезервыОстаткиИОбороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) 
						|	И уп_РезервыОстаткиИОбороты.Активность = Истина
						|СГРУППИРОВАТЬ ПО
						|	уп_РезервыОстаткиИОбороты.НомерСчета,
						|	уп_РезервыОстаткиИОбороты.ТипРезерва,
						|	уп_РезервыОстаткиИОбороты.ТипСуммы,
						|	уп_РезервыОстаткиИОбороты.ПенсионнаяСхема
						|ДЛЯ ИЗМЕНЕНИЯ
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	втОстатки.НомерСчета КАК НомерСчета,
						|	втОстатки.ТипРезерва КАК ТипРезерва,
						|	втОстатки.ТипСуммы КАК ТипСуммы,
						|	втОстатки.Сумма КАК Сумма,
						|	ЕСТЬNULL(втРасход.СуммаРасход, 0) КАК СуммаРасход,
						|	втОстатки.ПенсионнаяСхема КАК ПенсионнаяСхема, 
						|	втОстатки.СуммаНезафиксированногоИД КАК СуммаНезафиксированногоИД 
						|ИЗ
						|	втОстатки КАК втОстатки
						|		ЛЕВОЕ СОЕДИНЕНИЕ втРасход КАК втРасход
						|		ПО втОстатки.НомерСчета = втРасход.НомерСчета
						|			И втОстатки.ПенсионнаяСхема = втРасход.ПенсионнаяСхема
						|			И втОстатки.ТипРезерва = втРасход.ТипРезерва
						|			И втОстатки.ТипСуммы = втРасход.ТипСуммы")+" 
		#КонецВставки		
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НомерСчета";
		
		
		#Вставка
		Если Выбыл Тогда
			Запрос.УстановитьПараметр("ДатаВыбытия", РасчетныйДокумент.РегистрирующийДокумент.ДатаСмерти);
		КонецЕсли;		
		#КонецВставки		
		Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
		Запрос.УстановитьПараметр("МомВремени", ДатаЗакрытия-1);
		СписокТиповРезерва = Новый СписокЗначений;
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.ИПС);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.СПС);
		СписокТиповРезерва.Добавить(Перечисления.уп_ТипыРезерва.ПожизненныхВыплат);
		Запрос.УстановитьПараметр("СписокТиповРезерва", СписокТиповРезерва); 
		ТЗ = Запрос.Выполнить().Выгрузить();
		ТЗ.Колонки.Добавить("ИнвестДоход", Новый ОписаниеТипов("Число") );
		
		ЕстьРегистрирующийДокумент = Ложь;	
		Если ТипЗнч(РасчетныйДокумент) = Тип("ДокументСсылка.уп_ЗакрытиеСчетов") Тогда
			Если ЗначениеЗаполнено(РасчетныйДокумент.РегистрирующийДокумент) Тогда
				ЕстьРегистрирующийДокумент = Истина;
				РегистрирующийДокумент = РасчетныйДокумент.РегистрирующийДокумент;
			КонецЕсли;
		ИначеЕсли ТипЗнч(РасчетныйДокумент) = Тип("ДокументСсылка.уп_РасчетВыкупнойСуммыПоУмершим") Тогда
			Если ЗначениеЗаполнено(РасчетныйДокумент.ДокументОснование) Тогда
				ЕстьРегистрирующийДокумент = Истина;
				РегистрирующийДокумент = РасчетныйДокумент.ДокументОснование;
			КонецЕсли;
		КонецЕсли;
		
		ИмяМодуляРасчетаИД = уп_НПОСервер.ПолучитьИмяМодуляРасчетаИД();
		МодульРасчетаИД = ОбщегоНазначения.ОбщийМодуль(ИмяМодуляРасчетаИД);
		//начисление инвест дохода
		Если НачислитьДоход Тогда
			
			ПараметрыЗапроса = Новый Структура;
			ПараметрыЗапроса.Вставить("Организация",РасчетныйДокумент.Организация);
			ПараметрыЗапроса.Вставить("Ссылка",РасчетныйДокумент);
			ПараметрыЗапроса.Вставить("НомерСчета",НомерСчета);
			ПараметрыЗапроса.Вставить("Схема",Схема);
			ПараметрыЗапроса.Вставить("ПроцентДохода",Ставка);
			ПараметрыЗапроса.Вставить("НачалоПериода",ДатаНачала);
			ПараметрыЗапроса.Вставить("ДнейВГодуВсего",ДнейВГоду);
			ПараметрыЗапроса.Вставить("Дата",ДатаДок);
			ПараметрыЗапроса.Вставить("КонецПериода",КонецДня(ДатаКонца));
			ПараметрыЗапроса.Вставить("ДнейВГоду",ДнейВГоду);
			ПараметрыЗапроса.Вставить("ЕстьРегистрирующийДокумент",ЕстьРегистрирующийДокумент);
			ПараметрыЗапроса.Вставить("РегистрирующийДокумент",РегистрирующийДокумент);
			
			МодульРасчетаИД.НачислитьИДЗакрытиеДоговора(ТЗ,ПараметрыЗапроса);
			
		КонецЕсли;
		
		ИтогоНаСчете = ТЗ.Итог("Сумма")+ТЗ.Итог("ИнвестДоход");
		//теперь надо определить коэффициент выкупной стоимости
		КВС = РегистрыСведений.уп_КоэффициентВыкупнойСтоимости.ПолучитьПоследнее(ДатаДок, Новый Структура("ПенсионныйДоговор",НомерСчета.Владелец)).Коэффициент;
		ПенсионныеПравила = РегистрыСведений.уп_ПенсионныеПравила.ПолучитьПоследнее(ДатаДок, Новый Структура("Организация", РасчетныйДокумент.Организация));	
		//формируем ТЗРаспределение
		ТЗРаспределение.Колонки.Очистить();  //ТЗРаспределение = ТЗ.Скопировать();
		ТЗРаспределение.Колонки.Добавить("НомерСчета");
		ТЗРаспределение.Колонки.Добавить("ТипРезерва");
		ТЗРаспределение.Колонки.Добавить("ТипСуммы");
		ТЗРаспределение.Колонки.Добавить("ПенсионнаяСхема");
		ТЗРаспределение.Колонки.Добавить("СуммаНаСчете", Новый ОписаниеТипов("Число"));
		ТЗРаспределение.Колонки.Добавить("СуммаМГД", Новый ОписаниеТипов("Число") );   
		ТЗРаспределение.Колонки.Добавить("СуммаВыкупная", Новый ОписаниеТипов("Число") ); 
		ТЗРаспределение.Колонки.Добавить("СуммаВНачале", Новый ОписаниеТипов("Число") ); 
		ТЗРаспределение.Колонки.Добавить("СуммаВКонце", Новый ОписаниеТипов("Число") ); 
		ТЗРаспределение.Колонки.Добавить("СуммаСтраховая", Новый ОписаниеТипов("Число") ); 
		ТЗРаспределение.Колонки.Добавить("СуммаДоговора", Новый ОписаниеТипов("Число") ); 
		ТЗРаспределение.Колонки.Добавить("СуммаВкладчика", Новый ОписаниеТипов("Число") ); 
		ТЗРаспределение.Колонки.Добавить("ОблагаетсяНДФЛ");
		ТЗРаспределение.Колонки.Добавить("ИнвестДоход", Новый ОписаниеТипов("Число") );
		ТЗРаспределение.Колонки.Добавить("СуммаИДИзлишняя", Новый ОписаниеТипов("Число") ); 
		ТЗРаспределение.Колонки.Добавить("СуммаНезафиксированногоИД", Новый ОписаниеТипов("Число") ); 
		
		ТекСхема = Схема;
		ТекШаблон = РегистрыСведений.уп_ПараметрыПенсионногоДоговора.ПолучитьПоследнее(РасчетныйДокумент.Дата,Новый Структура("ПенсионныйДоговор",НомерСчета.Владелец)).ШаблонДоговора;
		Если ЕстьРегистрирующийДокумент Тогда
			Если ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное Тогда
				//тогда на дату регистрации
				Если ЗначениеЗаполнено(РегистрирующийДокумент.ДатаРегистрации) Тогда
					Если НачалоДня(РегистрирующийДокумент.ДатаРегистрации) <= НачалоДня(РегистрирующийДокумент.Дата) Тогда
						ДатаСостояний = РегистрирующийДокумент.Дата;
					Иначе
						ДатаСостояний = РегистрирующийДокумент.ДатаРегистрации+12*60*60;
					КонецЕсли;
				Иначе
					ДатаСостояний = РегистрирующийДокумент.Дата;
				КонецЕсли;	
				Состояние = РегистрыСведений.уп_СостоянияПС.ПолучитьПоследнее(ДатаСостояний-1, Новый Структура("Номерсчета", НомерСчета)).Состояние;
			Иначе                       
				Состояние = РегистрыСведений.уп_СостоянияПС.ПолучитьПоследнее(РегистрирующийДокумент.Дата-1, Новый Структура("Номерсчета", Номерсчета)).Состояние;
			КонецЕсли;
		Иначе
			//ищем дату закрытия
			ЗапросДаты = Новый Запрос;
			ЗапросДаты.Текст = 
			"ВЫБРАТЬ
			|	уп_СостоянияПССрезПоследних.НомерСчета КАК НомерСчета,
			|	уп_СостоянияПССрезПоследних.Период КАК ДатаСостояния
			|ИЗ
			|	РегистрСведений.уп_СостоянияПС.СрезПоследних(
			|			&ДатаДок,
			|			НомерСчета = &НомерСчета
			|				И Состояние = &ПодготовкаКЗакрытию) КАК уп_СостоянияПССрезПоследних";
			ЗапросДаты.УстановитьПараметр("ДатаДок", РасчетныйДокумент.Дата-1);
			ЗапросДаты.УстановитьПараметр("НомерСчета", НомерСчета);
			ЗапросДаты.УстановитьПараметр("ПодготовкаКЗакрытию", Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию);
			ВыборкаДаты = ЗапросДаты.Выполнить().Выбрать();
			Если ВыборкаДаты.Следующий() Тогда
				ДатаСостояния = ВыборкаДаты.ДатаСостояния-1;
			Иначе
				ЗапросДаты.УстановитьПараметр("ПодготовкаКЗакрытию", Перечисления.уп_СостоянияПС.Закрыт);
				ВыборкаДаты = ЗапросДаты.Выполнить().Выбрать();
				Если ВыборкаДаты.Следующий() Тогда
					ДатаСостояния = ВыборкаДаты.ДатаСостояния-1;
				Иначе
					ДатаСостояния = РасчетныйДокумент.Дата-1
				КонецЕсли;	
			КонецЕсли;
			//определяем состояние на дату закрытия
			Состояние = РегистрыСведений.уп_СостоянияПС.ПолучитьПоследнее(ДатаСостояния, Новый Структура("Номерсчета", Номерсчета)).Состояние;
		КонецЕсли;
		Если Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены 
			ИЛИ  Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены Тогда
			Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод;
		КонецЕсли;	
		//надо определить состояние счета, кол-во лет, прошедших с открытия счета и найти в регистре состав коэффициентов
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СостоянияПССрезПервых.Период КАК Период
		|ИЗ
		|	РегистрСведений.уп_СостоянияПС.СрезПервых(
		|		,
		|		НомерСчета = &НомерСчета
		|			И Состояние = &НакопительныйПериод) КАК СостоянияПССрезПервых
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период";
		
		Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
		Запрос.УстановитьПараметр("НакопительныйПериод", Перечисления.уп_СостоянияПС.НакопительныйПериод);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		ДатаОткрытияСчета = "";
		Пока Выборка.Следующий() Цикл
			ДатаОткрытияСчета = Выборка.Период;
			Прервать;
		КонецЦикла;
		
		Если ДатаОткрытияСчета = "" Тогда
			//проверим выплатной период
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	СостоянияПССрезПервых.Период КАК Период
			|ИЗ
			|	РегистрСведений.уп_СостоянияПС.СрезПервых(
			|		,
			|		НомерСчета = &НомерСчета
			|			И Состояние = &НакопительныйПериод) КАК СостоянияПССрезПервых
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период";
			
			Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
			Запрос.УстановитьПараметр("НакопительныйПериод", Перечисления.уп_СостоянияПС.ВыплатнойПериод);
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			ДатаОткрытияСчета = "";
			Пока Выборка.Следующий() Цикл
				ДатаОткрытияСчета = Выборка.Период;
				Прервать;
			КонецЦикла;
		КонецЕсли;
		
		Если ДатаОткрытияСчета = "" Тогда
			Сообщить("Счет не открыт, параметры расчета выкупной суммы не могут быть определены.");
			Возврат;
		КонецЕсли;
		
		//определим количество лет
		ТекДата = ДатаОткрытияСчета;
		КолЛет = 0;
		Пока ДобавитьМесяц(ТекДата,12)<ДатаДок Цикл
			КолЛет = КолЛет+1;
			ТекДата = ДобавитьМесяц(ТекДата,12);
		КонецЦикла;	
		
		//проверим, возможно это расторжение в период охлаждения 
		РасторжениеВПериодОхлаждения = Ложь;
		Если ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное  Тогда
			Если ЕстьРегистрирующийДокумент Тогда  //это закрытие и делается на основании заявления
				СтрЗаявления = РегистрирующийДокумент.СписокСчетов.Найти(НомерСчета, "НомерСчета");
				Если СтрЗаявления<>Неопределено Тогда
					Если СтрЗаявления.РасторжениеВПериодОхлаждения Тогда
						РасторжениеВПериодОхлаждения = Истина;
					КонецЕсли;	
				КонецЕсли;
			Иначе //это доначисление и надо искать на льготрых условиях было расторжение или нет	
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.Ссылка КАК Ссылка,
				|	уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.НомерСчета КАК НомерСчета,
				|	уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.РасторжениеВПериодОхлаждения КАК РасторжениеВПериодОхлаждения,
				|	уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.ДатаОкончанияПериодаОхлаждения КАК ДатаОкончанияПериодаОхлаждения
				|ИЗ
				|	Документ.уп_ЗаявлениеУчастникаОРасторженииНПО.СписокСчетов КАК уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов
				|ГДЕ
				|	уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.НомерСчета = &НомерСчета
				|	И уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.Ссылка.Проведен = ИСТИНА
				|	И уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.Ссылка.Дата <= &ДатаРасчета
				|
				|УПОРЯДОЧИТЬ ПО
				|	уп_ЗаявлениеУчастникаОРасторженииНПОСписокСчетов.Ссылка.Дата УБЫВ";
				
				Запрос.УстановитьПараметр("ДатаРасчета", ДатаЗакрытия);
				Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
				
				РезультатЗапроса = Запрос.Выполнить();
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Если ВыборкаДетальныеЗаписи.Следующий() Тогда
					Если ВыборкаДетальныеЗаписи.РасторжениеВПериодОхлаждения Тогда
						РасторжениеВПериодОхлаждения = Истина;
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		//ищем состав коэффициентов 
		Если НЕ РасторжениеВПериодОхлаждения Тогда
			//сначала ищем по договору
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	КоэффициентыДляРасчетаВыкупныхСумм.ТипРезерва КАК ТипРезерва,
			|	КоэффициентыДляРасчетаВыкупныхСумм.ТипСуммы КАК ТипСуммы,
			|	КоэффициентыДляРасчетаВыкупныхСумм.Коэффициент КАК Коэффициент,
			|	КоэффициентыДляРасчетаВыкупныхСумм.ДействияПоОстаткам КАК ДействияПоОстаткам,
			|	КоэффициентыДляРасчетаВыкупныхСумм.ВыплачиватьВНачале КАК ВыплачиватьВНачале,
			|	КоэффициентыДляРасчетаВыкупныхСумм.ПересчитыватьНаДатуСмерти КАК ПересчитыватьНаДатуСмерти
			|ИЗ
			|	РегистрСведений.уп_КоэффициентыДляРасчетаВыкупныхСумм КАК КоэффициентыДляРасчетаВыкупныхСумм
			|ГДЕ
			|	КоэффициентыДляРасчетаВыкупныхСумм.СхемаДоговор = &Договор
			|	И КоэффициентыДляРасчетаВыкупныхСумм.Состояние = &Состояние
			|	И КоэффициентыДляРасчетаВыкупныхСумм.НачалоПериода <= &КолЛет
			|	И КоэффициентыДляРасчетаВыкупныхСумм.КонецПериода >= &КолЛет
			|	И КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения = &ВидРасторжения";
			
			Запрос.УстановитьПараметр("Договор", НомерСчета.Владелец);
			Запрос.УстановитьПараметр("Состояние", Состояние);
			Запрос.УстановитьПараметр("КолЛет", КолЛет);
			Запрос.УстановитьПараметр("ВидРасторжения", ВидРасторжения);
			
			ТабКоэф = Запрос.Выполнить().Выгрузить();
			
			Если ТабКоэф.Количество()= 0 Тогда  //тогда ищем по шаблону
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	КоэффициентыДляРасчетаВыкупныхСумм.ТипРезерва КАК ТипРезерва,
				|	КоэффициентыДляРасчетаВыкупныхСумм.ТипСуммы КАК ТипСуммы,
				|	КоэффициентыДляРасчетаВыкупныхСумм.Коэффициент КАК Коэффициент,
				|	КоэффициентыДляРасчетаВыкупныхСумм.ДействияПоОстаткам КАК ДействияПоОстаткам,
				|	КоэффициентыДляРасчетаВыкупныхСумм.ВыплачиватьВНачале КАК ВыплачиватьВНачале,
				|	КоэффициентыДляРасчетаВыкупныхСумм.ПересчитыватьНаДатуСмерти КАК ПересчитыватьНаДатуСмерти
				|ИЗ
				|	РегистрСведений.уп_КоэффициентыДляРасчетаВыкупныхСумм КАК КоэффициентыДляРасчетаВыкупныхСумм
				|ГДЕ
				|	КоэффициентыДляРасчетаВыкупныхСумм.СхемаДоговор = &Шаблон
				|	И КоэффициентыДляРасчетаВыкупныхСумм.Состояние = &Состояние
				|	И КоэффициентыДляРасчетаВыкупныхСумм.НачалоПериода <= &КолЛет
				|	И КоэффициентыДляРасчетаВыкупныхСумм.КонецПериода >= &КолЛет
				|	И КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения = &ВидРасторжения";
				
				Запрос.УстановитьПараметр("Шаблон", ТекШаблон);
				Запрос.УстановитьПараметр("Состояние", Состояние);
				Запрос.УстановитьПараметр("КолЛет", КолЛет);
				Запрос.УстановитьПараметр("ВидРасторжения", ВидРасторжения);
				
				ТабКоэф = Запрос.Выполнить().Выгрузить();
			КонецЕсли;
			
			Если ТабКоэф.Количество()= 0 Тогда  //тогда ищем по схеме
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	КоэффициентыДляРасчетаВыкупныхСумм.ТипРезерва КАК ТипРезерва,
				|	КоэффициентыДляРасчетаВыкупныхСумм.ТипСуммы КАК ТипСуммы,
				|	КоэффициентыДляРасчетаВыкупныхСумм.Коэффициент КАК Коэффициент,
				|	КоэффициентыДляРасчетаВыкупныхСумм.ДействияПоОстаткам КАК ДействияПоОстаткам,
				|	КоэффициентыДляРасчетаВыкупныхСумм.ВыплачиватьВНачале КАК ВыплачиватьВНачале,
				|	КоэффициентыДляРасчетаВыкупныхСумм.ПересчитыватьНаДатуСмерти КАК ПересчитыватьНаДатуСмерти
				|ИЗ
				|	РегистрСведений.уп_КоэффициентыДляРасчетаВыкупныхСумм КАК КоэффициентыДляРасчетаВыкупныхСумм
				|ГДЕ
				|	КоэффициентыДляРасчетаВыкупныхСумм.СхемаДоговор = &Схема
				|	И КоэффициентыДляРасчетаВыкупныхСумм.Состояние = &Состояние
				|	И КоэффициентыДляРасчетаВыкупныхСумм.НачалоПериода <= &КолЛет
				|	И КоэффициентыДляРасчетаВыкупныхСумм.КонецПериода >= &КолЛет
				|	И КоэффициентыДляРасчетаВыкупныхСумм.ВидРасторжения = &ВидРасторжения";
				
				Запрос.УстановитьПараметр("Схема", ТекСхема);
				Запрос.УстановитьПараметр("Состояние", Состояние);
				Запрос.УстановитьПараметр("КолЛет", КолЛет);
				Запрос.УстановитьПараметр("ВидРасторжения", ВидРасторжения);
				
				ТабКоэф = Запрос.Выполнить().Выгрузить();
			КонецЕсли;   
		КонецЕсли;
		
		//получим шаблон договора и посмотрим, применяется ли по договору СПТ
		Договор = НомерСчета.Владелец;
		Если ЕстьРегистрирующийДокумент Тогда
			ШаблонДоговора = РегистрыСведений.уп_ПараметрыПенсионногоДоговора.ПолучитьПоследнее(РегистрирующийДокумент.Дата-1, Новый Структура("ПенсионныйДоговор", Договор)).ШаблонДоговора;
		Иначе
			ШаблонДоговора = РегистрыСведений.уп_ПараметрыПенсионногоДоговора.ПолучитьПоследнее(РасчетныйДокумент.Дата-1, Новый Структура("ПенсионныйДоговор", Договор)).ШаблонДоговора;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ШаблонДоговора) Тогда 
			ПоДоговоруИспользуетсяСПТ =  ШаблонДоговора.ИспользоватьСПТ;
		Иначе
			ПоДоговоруИспользуетсяСПТ = ЛОЖЬ;
		КонецЕсли;
		
		Если ЕстьРегистрирующийДокумент Тогда
			лНаличиеСПТ = РегистрыСведений.уп_ПенсионныеCчетаCСПТ.ПолучитьПоследнее(РегистрирующийДокумент.Дата-1, Новый Структура("Номерсчета", Номерсчета)).НаличиеСПТ;
		Иначе
			лНаличиеСПТ = РегистрыСведений.уп_ПенсионныеCчетаCСПТ.ПолучитьПоследнее(РасчетныйДокумент.Дата-1, Новый Структура("Номерсчета", Номерсчета)).НаличиеСПТ;
		КонецЕсли;
		Для каждого стр из ТЗ цикл
			НовСтр = ТЗРаспределение.Добавить();
			НовСтр.НомерСчета = стр.НомерСчета;
			НовСтр.ТипРезерва = стр.ТипРезерва;
			НовСтр.ТипСуммы = стр.ТипСуммы;
			НовСтр.СуммаНаСчете = стр.Сумма;
			НовСтр.СуммаМГД = стр.ИнвестДоход;
			НовСтр.ПенсионнаяСхема = стр.ПенсионнаяСхема; 
			НовСтр.СуммаНезафиксированногоИД = стр.СуммаНезафиксированногоИД;
			СуммаДляРасчета = стр.Сумма;
			#Вставка
			Если Выбыл Тогда 
				СуммаДляРасчета = СуммаДляРасчета + стр.СуммаРасход; 
				НовСтр.СуммаНаСчете = стр.Сумма + стр.СуммаРасход;
			КонецЕсли;
		    #КонецВставки		
			Если РасторжениеВПериодОхлаждения Тогда //выплачиваем все
				НовСтр.СуммаВыкупная = СуммаДляРасчета+стр.ИнвестДоход;
				НовСтр.СуммаВНачале = НовСтр.СуммаВыкупная;
			Иначе                                
				Если (Состояние = Перечисления.уп_СостоянияПС.НакопительныйПериод
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВНакопительныйПериод)  
					
					или (Состояние = Перечисления.уп_СостоянияПС.НакопительныйПериод
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВНакопительныйПериод) 
					
					или (Состояние = Перечисления.уп_СостоянияПС.НакопительныйПериод
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВНакопительныйПериод)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВНакопительныйПериод)  
					
					или (Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВНакопительныйПериод) 
					
					или (Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВНакопительныйПериод)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВВыплатнойПериод)   
					
					или (Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВВыплатнойПериод) 
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВВыплатнойПериод)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВВыплатнойПериод) 
					
					или (Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВВыплатнойПериод)  
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВВыплатнойПериод) 
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВВыплатнойПериод) 
					
					или (Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВВыплатнойПериод) 
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены
					и НЕ ПоДоговоруИспользуетсяСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВВыплатнойПериод) 
					
					//все тоже самое с СПТ
					или (Состояние = Перечисления.уп_СостоянияПС.НакопительныйПериод
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ 
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВНакопительныйПериодСПТ)
					
					или (Состояние = Перечисления.уп_СостоянияПС.НакопительныйПериод
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВНакопительныйПериодСПТ)
					
					или (Состояние = Перечисления.уп_СостоянияПС.НакопительныйПериод
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВНакопительныйПериодСПТ)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВНакопительныйПериодСПТ)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВНакопительныйПериодСПТ)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ПодготовкаКЗакрытию
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВНакопительныйПериодСПТ)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВВыплатнойПериодСПТ) 
					
					или (Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВВыплатнойПериодСПТ)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти
					и ТекСхема.НаследованиеВВыплатнойПериодСПТ)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВВыплатнойПериодСПТ)
					
					или (Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВВыплатнойПериодСПТ)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ
					и ТекСхема.РасторжениеВВыплатнойПериодСПТ) 
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатнойПериод
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВВыплатнойПериодСПТ) 
					
					или (Состояние = Перечисления.уп_СостоянияПС.НачисленияПриостановлены
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВВыплатнойПериодСПТ)
					
					или (Состояние = Перечисления.уп_СостоянияПС.ВыплатыПриостановлены
					и ПоДоговоруИспользуетсяСПТ и лНаличиеСПТ
					и ВидРасторжения = Перечисления.уп_ВидыРасторжения.Досрочное
					и ТекСхема.РасторжениеВВыплатнойПериодСПТ) Тогда
					
					НаборСтрок = ТабКоэф.НайтиСтроки(Новый Структура("ТипРезерва, ТипСуммы",стр.ТипРезерва,стр.ТипСуммы));
					Если НаборСтрок.Количество()>0 Тогда
						СтрокаНабора = НаборСтрок[0];
						Коэф = СтрокаНабора.Коэффициент;
						ДействияПоОстаткам = СтрокаНабора.ДействияПоОстаткам;
						ВыплачиватьВНачале = СтрокаНабора.ВыплачиватьВНачале;
						ПересчитыватьНаДатуСмерти = СтрокаНабора.ПересчитыватьНаДатуСмерти;
					Иначе
						Коэф = 1;
						ДействияПоОстаткам = Перечисления.уп_ДействияПоОстаткам.СтраховойРезерв;
						ВыплачиватьВНачале = Истина;
						ПересчитыватьНаДатуСмерти = Ложь;
					КонецЕсли;
					
					Если ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти И ПересчитыватьНаДатуСмерти Тогда
						Если стр.ТипСуммы.Родитель = Справочники.уп_ТипыСумм.Взносы Тогда
							ПараметрыЗапроса = Новый Структура;
							ПараметрыЗапроса.Вставить("Организация",РасчетныйДокумент.Организация);
							ПараметрыЗапроса.Вставить("НомерСчета",НомерСчета);
							ПараметрыЗапроса.Вставить("ТипРезерва",стр.ТипРезерва);
							ПараметрыЗапроса.Вставить("ТипСуммы",стр.ТипСуммы);
							ПараметрыЗапроса.Вставить("НачалоПериода",НомерСчета.Участник.уп_ФизЛицо.уп_ДатаСмерти);
							ПараметрыЗапроса.Вставить("КонецПериода",ДатаДок);
							СуммаЛишнихВзносов = уп_НПОСервер.ПолучитьСуммуВзносовЗаПериод(ПараметрыЗапроса);
							//стр.Сумма = Макс(0,стр.Сумма-СуммаЛишнихВзносов);
							СуммаДляРасчета = Макс(0,стр.Сумма-СуммаЛишнихВзносов);
						ИначеЕсли стр.ТипСуммы.Родитель = Справочники.уп_ТипыСумм.ИнвестДоход Тогда
							лКонецПериода = НомерСчета.Участник.уп_ФизЛицо.уп_ДатаСмерти;
							ТекГод = НачалоГода(лКонецПериода);
							
							ПараметрыЗапроса = Новый Структура;
							ПараметрыЗапроса.Вставить("Организация",РасчетныйДокумент.Организация);
							ПараметрыЗапроса.Вставить("Ссылка",РасчетныйДокумент.Ссылка);
							ПараметрыЗапроса.Вставить("НомерСчета",НомерСчета);
							
							ПараметрыЗапроса.Вставить("НачалоПериода",ТекГод);
							ПараметрыЗапроса.Вставить("ДнейВГодуВсего",Цел((КонецГода(ТекГод)- НачалоГода(ТекГод)+1)/(60*60*24)));
							ПараметрыЗапроса.Вставить("ДатаРасчета",ДатаДок);
							ПараметрыЗапроса.Вставить("Дата",ДатаДок);
							ПараметрыЗапроса.Вставить("ТипСуммы",стр.ТипСуммы);
							ПараметрыЗапроса.Вставить("ТипРезерва",стр.ТипРезерва);
							
							ПараметрыЗапроса.Вставить("КонецПериода",КонецДня(лКонецПериода));
							ПараметрыЗапроса.Вставить("ДнейВГоду",Цел((КонецДня(лКонецПериода)- НачалоГода(ТекГод)+1)/(60*60*24)));
							
							СуммаЛишнегоИД = МодульРасчетаИД.ПолучитьИДПоСчетуПослеДаты(ПараметрыЗапроса);
							
							СуммаДляРасчета = Макс(0,стр.Сумма-СуммаЛишнегоИД);
							НовСтр.СуммаИДИзлишняя = стр.Сумма-СуммаДляРасчета;
						КонецЕсли;
					КонецЕсли;
					
					
					//НовСтр.СуммаВыкупная = Окр((стр.Сумма+стр.ИнвестДоход)*Коэф,2);
					НовСтр.СуммаВыкупная = Окр((СуммаДляРасчета+стр.ИнвестДоход)*Коэф,2);
					Если ВыплачиватьВНачале Тогда
						НовСтр.СуммаВНачале = НовСтр.СуммаВыкупная;
					Иначе
						НовСтр.СуммавКонце = НовСтр.СуммаВыкупная;
					КонецЕсли;
					Остаток = стр.Сумма+стр.ИнвестДоход-НовСтр.СуммаВыкупная;
					
					Если НЕ ЗначениеЗаполнено(ДействияПоОстаткам) или ДействияПоОстаткам = Перечисления.уп_ДействияПоОстаткам.СтраховойРезерв Тогда
						НовСтр.СуммаСтраховая = Остаток;
					ИначеЕсли ДействияПоОстаткам = Перечисления.уп_ДействияПоОстаткам.СчетДоговора Тогда
						НовСтр.СуммаДоговора = Остаток;
					КонецЕсли;	
					
				Иначе //все равно считаем, но обнуляем выкупную сумму
					НаборСтрок = ТабКоэф.НайтиСтроки(Новый Структура("ТипРезерва, ТипСуммы",стр.ТипРезерва,стр.ТипСуммы));
					Если НаборСтрок.Количество()>0 Тогда
						СтрокаНабора = НаборСтрок[0];
						Коэф = СтрокаНабора.Коэффициент;
						ДействияПоОстаткам = СтрокаНабора.ДействияПоОстаткам;
						ВыплачиватьВНачале = СтрокаНабора.ВыплачиватьВНачале;
					Иначе
						Коэф = 0;
						ДействияПоОстаткам = Перечисления.уп_ДействияПоОстаткам.СтраховойРезерв;
						ВыплачиватьВНачале = Истина;
					КонецЕсли;
					Остаток = стр.Сумма+стр.ИнвестДоход;
					
					Если НЕ ЗначениеЗаполнено(ДействияПоОстаткам) или ДействияПоОстаткам = Перечисления.уп_ДействияПоОстаткам.СтраховойРезерв Тогда
						НовСтр.СуммаСтраховая = Остаток;
					ИначеЕсли ДействияПоОстаткам = Перечисления.уп_ДействияПоОстаткам.СчетДоговора Тогда
						НовСтр.СуммаДоговора = Остаток;
					КонецЕсли;	
					
					НовСтр.СуммаВыкупная = 0;
					НовСтр.СуммаВНачале = 0;
				КонецЕсли;
			КонецЕсли;
			Если ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПоСмерти Тогда
				Если ПенсионныеПравила.НачислениеПоПравуНаследованияОблагаетсяНДФЛ Тогда
					НовСтр.ОблагаетсяНДФЛ = Истина;
				Иначе
					НовСтр.ОблагаетсяНДФЛ = Ложь;
				КонецЕсли;	
			ИначеЕсли ВидРасторжения = Перечисления.уп_ВидыРасторжения.ПереходВДругойНПФ Тогда
				НовСтр.ОблагаетсяНДФЛ = Ложь;
			ИначеЕсли РасторжениеВПериодОхлаждения Тогда
				НовСтр.ОблагаетсяНДФЛ = Ложь;
			Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	ПенсионныеСхемыИсточникиВыплат_ИПС.ОблагаетсяНДФЛПриРасторжении КАК ОблагаетсяНДФЛ
				|ИЗ
				|	Справочник.уп_ПенсионныеСхемы.ИсточникиВыплат_ИПС КАК ПенсионныеСхемыИсточникиВыплат_ИПС
				|ГДЕ
				|	ПенсионныеСхемыИсточникиВыплат_ИПС.Ссылка = &ТекСхема
				|	И ПенсионныеСхемыИсточникиВыплат_ИПС.ТипРезерва = &ТипРезерва
				|	И ПенсионныеСхемыИсточникиВыплат_ИПС.ТипСуммы = &ТипСуммы";
				
				Запрос.УстановитьПараметр("ТекСхема", ТекСхема);
				Запрос.УстановитьПараметр("ТипРезерва", стр.ТипРезерва);
				Запрос.УстановитьПараметр("ТипСуммы", стр.ТипСуммы);
				
				Результат = Запрос.Выполнить();
				Выборка = Результат.Выбрать();
				Облагается = Истина;
				Пока Выборка.Следующий() Цикл
					Облагается = Выборка.ОблагаетсяНДФЛ;
					Прервать;
				КонецЦикла;
				НовСтр.ОблагаетсяНДФЛ = Облагается;
			КонецЕсли;	
		КонецЦикла;	
		
		//Теперь органичение сверху по коэффициенту выкупной стоимости
		//рассчитаем коэф. выкупной ст-сти
		Если (ТЗРаспределение.Итог("СуммаНаСчете")+ТЗРаспределение.Итог("СуммаМГД"))>0 Тогда
			КоэфВС = (ТЗРаспределение.Итог("СуммаВыкупная"))/(ТЗРаспределение.Итог("СуммаНаСчете")+ТЗРаспределение.Итог("СуммаМГД"));
			КВС = РегистрыСведений.уп_КоэффициентВыкупнойСтоимости.ПолучитьПоследнее(ДатаДок, Новый Структура("ПенсионныйДоговор",НомерСчета.Владелец)).Коэффициент;
			
			Если КВС<>0 и (КоэфВС>КВС) Тогда
				ВыкупнаяСумма = (ТЗ.Итог("Сумма")+ТЗ.Итог("ИнвестДоход"))*КВС;
				Разница = ТЗРаспределение.Итог("СуммаВыкупная")-ВыкупнаяСумма;
				//распределим разницу
				Для каждого стр из ТЗРаспределение Цикл
					Если стр.ТипСуммы<>Справочники.уп_ТипыСумм.ВзносыФиз и стр.ТипСуммы<>Справочники.уп_ТипыСумм.ИДФиз Тогда
						Если стр.СуммаВыкупная>=Разница Тогда
							стр.СуммаВыкупная = стр.СуммаВыкупная-Разница;
							стр.СуммаСтраховая = стр.СуммаСтраховая+Разница;
							Разница = 0;
							Прервать;
						Иначе
							Списываем = стр.СуммаВыкупная;
							стр.СуммаВыкупная = 0;
							стр.СуммаСтраховая = стр.СуммаСтраховая+Списываем;
							Разница = Разница-Списываем;
						КонецЕсли;	
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
		
		// Распределение по получетелям
		
		ТЗПолучатели = ТЗРаспределение.Скопировать();
	КонецЕсли;
КонецПроцедуры
